<?php
/**
 * 冒泡排序
 * 数据结构----------------数组
 * 最差时间复杂度-----------O(n^2)
 * 最优时间复杂度-----------O(n)
 * 平均时间复杂度-----------O(n^2)
 * 空间复杂度---------------O(1)
 * 稳定性------------------稳定
 */

$arr = [1, 3, 34, 2, 32, 2, 78, -43, 53, -35, 0];

function BubbleSort($arr)
{
    $length = count($arr);
    for ($i = 0; $i < $length - 1; $i++) { 			// 每次最大元素移到数组最后
        for ($j = 0; $j < $length - 1 - $i; $j++) {     // 内部循环次数=数组长度-已经排序好的个数-1
            if ($arr[$j] > $arr[$j + 1]) {	        // 比较相邻两个元素，较大的后移
                $t = $arr[$j];
                $arr[$j] = $arr[$j + 1];
                $arr[$j + 1] = $t;
            }
        }
    }
    return $arr;
}

print_r(BubbleSort($arr));
